cask_args appdir: "/Applications"

# Taps
tap "homebrew/cask"
tap "gocardless/homebrew-taps"

# General tooling
brew "ack"
brew "autoenv"
brew "automake"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "findutils"
brew "gawk"
brew "git"
brew "git-extras"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "gnutls"
brew "hub"
brew "jq"
brew "libtool"
brew "mercurial"
brew "neovim"
brew "pam_yubico"
brew "pstree"
brew "qt"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "youtube-dl"
brew "zsh"

# Databases
cask "homebrew/cask-versions/java8" # elasticsearch requirement
brew "elasticsearch"
brew "mongodb"
brew "postgresql"
brew "redis"

# Languages
brew "go@1.11"
brew "python"
brew "rbenv"
brew "ruby-build"

# GoCardless
brew "anu"
brew "draupnir"

# Kubernetes
brew "kubernetes-cli"

# Google
cask "google-cloud-sdk"

# AWS
brew "awscli"
brew "aws-keychain"

# Infrastructure
brew "terraform"
